constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injector1
{
    timeStart       10;
    duration        100;
    selectionMode   points;
    points
    (
        (0.38 2.03 0.0)
    );
}

options
{
    massSource1
    {
        type            scalarSemiImplicitSource;

        $injector1;

        volumeMode      absolute;
        sources
        {
            thermo:rho.air    (2.8e-6 0);  // kg/s
        }
    }
/*
    momentumSource1
    {
        type            vectorSemiImplicitSource;

        $injector1;

        volumeMode      absolute;
        sources
        {
                U.steam         ((0 1e-2 0) 0);  // kg*m/s^2
        }
    }
*/
    energySource1
    {
        type            scalarSemiImplicitSource;

        $injector1;

        volumeMode      absolute;
        sources
        {
            h.air     (1 0);  // kg*m^2/s^3
        }
    }

}


// ************************************************************************* //