system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "geometry/geo.fms";

minCellSize 0.02;

maxCellSize 0.10;

boundaryCellSize 0.10;


localRefinement
{
    "pipe"
    {
        cellSize 0.0125;
    }

}

objectRefinements
{
    topbox
    {
        type    box;
        cellSize 0.0125;
        centre  (1.05 1.95 0);
        lengthX 1.3;
        lengthY 0.1;
        lengthZ 0.03;
    }

    bttmbox
    {
        type    box;
        cellSize 0.0125;
        centre  (1.05 0 0);
        lengthX 1.5;
        lengthY 0.1;
        lengthZ 0.03;
    }
}

boundaryLayers
{
    nLayers 3;

    thicknessRatio 1.1;

    maxFirstLayerThickness 0.01;

//    patchBoundaryLayers
//    {
//    }
}

renameBoundary
{

    newPatchNames
    {
        "inlet"
        {
            type    patch;
            newName inlet;
        }
/*
        "inj"
        {
            type    patch;
            newName inj;
        }
*/
        "outlet"
        {
            type    patch;
            newName outlet;
        }

        "pipe"
        {
            type    wall;
            newName walls;
        }
/*
        "inject_pipe"
        {
            type    wall;
            newName wall_inj;
        }
        */
    }
}


// ************************************************************************* //
